---
title: FabricationAncillaryUsage
classe: Autodesk.Revit.DB.FabricationAncillaryUsage
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# FabricationAncillaryUsage

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double AncillaryDepth { get; }` | `fabricationAncillaryUsage.AncillaryDepth` | Double |
| `Int32 AncillaryId { get; }` | `fabricationAncillaryUsage.AncillaryId` | Int32 |
| `Double AncillaryWidthOrDiameter { get; }` | `fabricationAncillaryUsage.AncillaryWidthOrDiameter` | Double |
| `Boolean IsValidObject { get; }` | `fabricationAncillaryUsage.IsValidObject` | Boolean |
| `Double Length { get; }` | `fabricationAncillaryUsage.Length` | Double |
| `String ProductCode { get; }` | `fabricationAncillaryUsage.ProductCode` | String |
| `Double Quantity { get; }` | `fabricationAncillaryUsage.Quantity` | Double |
| `FabricationAncillaryType Type { get; }` | `fabricationAncillaryUsage.Type` | FabricationAncillaryType |
| `FabricationAncillaryUsageType UsageType { get; }` | `fabricationAncillaryUsage.UsageType` | FabricationAncillaryUsageType |
| `Void Dispose()` | `fabricationAncillaryUsage.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```